In [1]:
import pandas as pd

## Making dataframe

In [3]:
df = pd.DataFrame({"population":[23,34,45,56,67,82,76],
                  "GDP":[3,4,5,6,3,6,4],
                  "HDI":[1,2,1,1,2,1,1],
                  "continent":["Asia", "Asia", "Europe","America","Austrailia","Europe", "Asia"]})
df

   population  GDP  HDI   continent
0          23    3    1        Asia
1          34    4    2        Asia
2          45    5    1      Europe
3          56    6    1     America
4          67    3    2  Austrailia
5          82    6    1      Europe
6          76    4    1        Asia

## change index

In [4]:
df.index = ["Pakistan","India","London","USA","Sydney","Romania","Srilanka"]

In [5]:
df

          population  GDP  HDI   continent
Pakistan          23    3    1        Asia
India             34    4    2        Asia
London            45    5    1      Europe
USA               56    6    1     America
Sydney            67    3    2  Austrailia
Romania           82    6    1      Europe
Srilanka          76    4    1        Asia

In [6]:
df.columns   #showing columns

Index(['population', 'GDP', 'HDI', 'continent'], dtype='object')

In [10]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 7 entries, Pakistan to Srilanka
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   population  7 non-null      int64
 1   GDP         7 non-null      int64
 2   HDI         7 non-null      int64
 3   continent   7 non-null      object
dtypes: int64(3), object(1)
memory usage: 280.0+ bytes

In [11]:
df.describe()

       population       GDP       HDI
count    7.000000  7.000000  7.000000
mean    54.714286  4.428571  1.285714
std     21.906729  1.272418  0.487950
min     23.000000  3.000000  1.000000
25%     39.500000  3.500000  1.000000
50%     56.000000  4.000000  1.000000
75%     71.500000  5.500000  1.500000
max     82.000000  6.000000  2.000000

In [12]:
df.describe(include = "all") #giving statistical summary of all columns including object dtype columns

        population       GDP       HDI continent
count     7.000000  7.000000  7.000000         7
unique         NaN       NaN       NaN         4
top            NaN       NaN       NaN      Asia
freq           NaN       NaN       NaN         3
mean     54.714286  4.428571  1.285714       NaN
std      21.906729  1.272418  0.487950       NaN
min      23.000000  3.000000  1.000000       NaN
25%      39.500000  3.500000  1.000000       NaN
50%      56.000000  4.000000  1.000000       NaN
75%      71.500000  5.500000  1.500000       NaN
max      82.000000  6.000000  2.000000       NaN

In [18]:
df.value_counts()

population  GDP  HDI  continent
23          3    1    Asia          1
34          4    2    Asia          1
45          5    1    Europe        1
56          6    1    America       1
67          3    2    Austrailia    1
76          4    1    Asia          1
82          6    1    Europe        1
Name: count, dtype: int64

In [23]:
df['continent'].value_counts()

continent
Asia          3
Europe        2
America       1
Austrailia    1
Name: count, dtype: int64

In [25]:
df.values  #retrive data within table

array([[23, 3, 1, 'Asia'],
       [34, 4, 2, 'Asia'],
       [45, 5, 1, 'Europe'],
       [56, 6, 1, 'America'],
       [67, 3, 2, 'Austrailia'],
       [82, 6, 1, 'Europe'],
       [76, 4, 1, 'Asia']], dtype=object)

## Indexing

In [27]:
df.loc['India'] #loc is used for textiual index

population      34
GDP              4
HDI              2
continent     Asia
Name: India, dtype: object

In [28]:
df.loc['India':'Srilanka']

          population  GDP  HDI   continent
India             34    4    2        Asia
London            45    5    1      Europe
USA               56    6    1     America
Sydney            67    3    2  Austrailia
Romania           82    6    1      Europe
Srilanka          76    4    1        Asia

In [31]:
df.loc['London':'Srilanka', 'population']

London      45
USA         56
Sydney      67
Romania     82
Srilanka    76
Name: population, dtype: int64

In [32]:
df.loc['Pakistan':'London',['population', 'GDP','continent']]

          population  GDP continent
Pakistan          23    3      Asia
India             34    4      Asia
London            45    5    Europe

In [34]:
df.loc[['Pakistan','India','Srilanka'],['population', 'GDP','continent']]

          population  GDP continent
Pakistan          23    3      Asia
India             34    4      Asia
Srilanka          76    4      Asia

In [35]:
df.iloc[0]    #retrive data by numerical index

population      23
GDP              3
HDI              1
continent     Asia
Name: Pakistan, dtype: object

In [36]:
df

          population  GDP  HDI   continent
Pakistan          23    3    1        Asia
India             34    4    2        Asia
London            45    5    1      Europe
USA               56    6    1     America
Sydney            67    3    2  Austrailia
Romania           82    6    1      Europe
Srilanka          76    4    1        Asia

In [37]:
london_pop = df.iloc[2,0]
london_pop

45

In [38]:
df.iloc[0:4, [0,3]]

          population continent
Pakistan          23      Asia
India             34      Asia
London            45    Europe
USA               56   America

In [39]:
romania_continent = df.iloc[5,3]
romania_continent

'Europe'

## Dropping rows and columns

In [40]:
df

          population  GDP  HDI   continent
Pakistan          23    3    1        Asia
India             34    4    2        Asia
London            45    5    1      Europe
USA               56    6    1     America
Sydney            67    3    2  Austrailia
Romania           82    6    1      Europe
Srilanka          76    4    1        Asia

if we want to drop row then

In [42]:
df.drop('London', axis = 0)

          population  GDP  HDI   continent
Pakistan          23    3    1        Asia
India             34    4    2        Asia
USA               56    6    1     America
Sydney            67    3    2  Austrailia
Romania           82    6    1      Europe
Srilanka          76    4    1        Asia

In [51]:
df.drop['GDP', axis = 1]

SyntaxError: invalid syntax. Maybe you meant '==' or ':=' instead of '='? (3453087161.py, line 1)